OpenFOAM/thermofluid/tutorials/deprecatedTutorials/bubbleRiseIsoCase2/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

MetalProperties
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 0.01;
    rhoS              1000;
    rhoL              1000;

	/*
	CrossPowerLawCoeffs
    {
        nu0             nu0 [ 0 2 -1 0 0 0 0 ] 0.01;
        nuInf           nuInf [ 0 2 -1 0 0 0 0 ] 0.01;
        m               m [ 0 0 1 0 0 0 0 ] 1;
        n               n [ 0 0 0 0 0 0 0 ] 0;
    } 
	*/
}

GasProperties
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 0.1;
    rhoG            1;
 
	/*
   CrossPowerLawCoeffs
    {
        nu0             nu0 [ 0 2 -1 0 0 0 0 ] 0.1;
        nuInf           nuInf [ 0 2 -1 0 0 0 0 ] 0.1;
        m               m [ 0 0 1 0 0 0 0 ] 1;
        n               n [ 0 0 0 0 0 0 0 ] 0;
    }
	*/
}


sigma           sigma [ 1 0 -2 0 0 0 0 ] 1.96;
STgrad		STgrad [1 0 -2 -1 0 0 0] -1e-10; //small value as ST is assumed the same everywhere

// ************************************************************************* //
